{"Tuna": "A tuna (also called tunny) is a saltwater fish that belongs to the tribe Thunnini, a subgrouping of the Scombridae (mackerel) family. The Thunnini comprise 15 species across five genera, the sizes of which vary greatly, ranging from the bullet tuna (max. length: 50 cm (1.6 ft), weight: 1.8 kg (4 lb)) up to the Atlantic bluefin tuna (max. length: 4.6 m (15 ft), weight: 684 kg (1,508 lb)). The Atlantic bluefin averages 2 m (6.6 ft), and is believed to live up to 50 years.\nTuna, opah, and mackerel sharks are the only species of fish that can maintain a body temperature higher than that of the surrounding water. An active and agile predator, the tuna has a sleek, streamlined body, and is among the fastest-swimming pelagic fish – the yellowfin tuna, for example, is capable of speeds of up to 75 km/h (47 mph). However, greatly inflated speeds can be found in early scientific reports and still widely reported in the popular literature. Found in warm seas, it is extensively fished commercially, and is popular as a game fish. As a result of overfishing, some tuna species, such as the southern bluefin tuna, are threatened with extinction.", "Jawfish": "Opistognathidae, the jawfishes, are a family of fishes which have been classified within the order Perciformes, suborder Percoidei but many authorities now classify this family within the clade Ovalentaria and consider that its affinities within that clade are uncertain, i.e. it is incertae sedis. The family includes about 80 species. They are native to warmer parts of the Atlantic, Pacific and Indian Oceans, where found from the shallows to depths of a few hundred meters. The species level taxonomy is complex and the family includes several undescribed species.\nPhysically similar to blennies, most jawfish species are small fish (up to 10 cm or 3.9 in) with an elongated body plan. A few species, for example the aptly named giant jawfish (O. rhomaleus), reaches about 0.5 m (1 ft 8 in). Their heads, mouths, and eyes are large in size relative to the rest of their bodies. Jawfishes possess a single, long dorsal fin with 9-12 spines and a caudal fin that can be either rounded or pointed.\nJawfishes typically reside in burrows they construct in sandy substrate. They will stuff their mouths with sand and spit it out elsewhere, slowly creating a tunnel. Using the protection of these burrows, these fish will hover, feeding on plankton or other small organisms, ready to dart back in at the first sign of danger. They are territorial of the area around their burrows.\nWith the exception of the blue-spotted jawfish O. rosenblatti, Jawfishes are mouthbrooders, meaning their eggs hatch in their mouths, where the newborn fry are protected from predators.\nThe gestation period varies between species. Gold-specs jawfish (Opistognathus randalli) typically keep their clutch of eggs for 8–10 days before hatching.", "A_Yellow_Goatfish": "The yellow goatfish (Mulloidichthys martinicus), also known as yellowsaddle, is a species of goatfish native to the Atlantic Ocean around the coasts of Africa and the Americas.  This species can reach a length of 39.4 centimetres (15.5 in) TL, but most reach lengths only around 28 centimetres (11 in).  They are of minor importance to local commercial fisheries, even though they have been reported to carry the ciguatera toxin.", "Dasyatidae-whiptail-stingrays": "The whiptail stingrays are a family, the Dasyatidae, of rays in the order Myliobatiformes. They are found worldwide in tropical to temperate marine waters, and a number of species have also penetrated into fresh water in Africa, Asia, and Australia. Members of this family have flattened pectoral fin discs that range from oval to diamond-like in shape. Their common name comes from their whip-like tails, which are much longer than the disc and lack dorsal and caudal fins. All whiptail stingrays, except the porcupine ray (Urogymnus asperrimus), have one or more venomous stings near the base of the tail, which is used in defense. They range in size from 0.18 to 2.0 m (0.59 to 6.56 ft) or more across.", "Filefish": "The filefish (Monacanthidae) are a diverse family of tropical to subtropical tetraodontiform marine fish, which are also known as foolfish, leatherjackets or shingles. They live in the Atlantic, Pacific and Indian Oceans. Filefish are closely related to the triggerfish, pufferfish and trunkfish.\nThe filefish family comprises approximately 102 species in 27 genera. More than half of the species are found in Australian waters, with 58 species in 23 genera.Their laterally compressed bodies and rough, sandpapery skin inspired the filefish's common name; it is said that dried filefish skin was once used to finish wooden boats.", "Pseudochromis": "Pseudochromis is a genus of fish in the family Pseudochromidae found in Indian and Pacific Ocean.", "Rajidae-skates": "Skates are cartilaginous fish belonging to the family Rajidae in the superorder Batoidea of rays. More than 150 species have been described, in 17 genera. Softnose skates and pygmy skates were previously treated as subfamilies of Rajidae (Arhynchobatinae and Gurgesiellinae), but are now considered as distinct families. Alternatively, the name \"skate\" is used to refer to the entire order of Rajiformes (families Anacanthobatidae, Arhynchobatidae, Gurgesiellidae and Rajidae).Members of Rajidae are distinguished by their stiff snout and a rostrum that is not reduced.", "Blennies": "Combtooth blennies are blenniiformids; percomorph marine fish of the family Blenniidae, part of the order Blenniiformes. They are the largest family of blennies with around 400 known species. Combtooth blennies are found in tropical and subtropical waters in the Atlantic, Pacific and Indian Oceans; some species are also found in brackish and even freshwater environments.", "Frogfish": "Frogfishes are any member of the anglerfish family Antennariidae, of the order Lophiiformes. Antennariids are known as anglerfishes in Australia, where the term \"frogfish\" refers to members of the unrelated family Batrachoididae. Frogfishes are found in almost all tropical and subtropical oceans and seas around the world, the primary exception being the Mediterranean Sea.\nFrogfishes are small, short and stocky, and sometimes covered in spinules and other appendages to aid in camouflage. The camouflage aids in protection from predators and enables them to lure prey. Many species can change colour; some are covered with other organisms such as algae or hydrozoa. In keeping with this camouflage, frogfishes typically move slowly, lying in wait for prey, and then striking extremely rapidly, in as little as 6 milliseconds.\nFew traces of frogfishes remain in the fossil record, though Antennarius monodi is known from the Miocene of Algeria and Eophryne barbuttii is known from the Eocene of Italy.\n\n", "Bonito": "The Atlantic bonito (Sarda sarda) is a large mackerel-like fish of the family Scombridae. It is common in shallow waters of the Atlantic Ocean, the Mediterranean Sea, and the Black Sea, where it is an important commercial and game fish.", "Hawkfish": "The hawkfishes are strictly tropical, perciform marine fishes of the family Cirrhitidae associated with the coral reefs of the western and eastern Atlantic and Indo-Pacific. They share many morphological features with the scorpionfish of the family Scorpaenidae.\n\nHawkfishes have large heads with thick, somewhat elongated bodies. Their dorsal fins are merged, with the first consisting of 10 connected spines. At the tip of each spine are several trailing filaments, hence the family name Cirrhitidae, from the Latin cirrus meaning \"fringe\". Their tail fins are rounded and truncated, and their pectoral fins are enlarged and scaleless. Their scales may be cycloid or ctenoid. Most hawkfishes are small, from about 7–15 cm in length. The largest species, the giant hawkfish (Cirrhitus rivulatus) attains a length of 60 cm and a weight of 4 kg. A commercial fishery exists for the larger species, as they are considered excellent food fishes.\nThe vibrant colours exhibited by most hawkfishes have won them popularity in the aquarium hobby, aided by the fishes' reputation for unproblematic upkeep and easy acclimation to tank life. Popularly kept species include the longnose hawkfish (Oxycirrhites typus), which is coloured in a red and pink crosshatch pattern, and the flame hawkfish (Neocirrhites armatus).\nBecause of their large, skinless pectoral fins, hawkfishes are able to perch upon fire corals without incurring harm. Actually hydrozoans rather than true corals, fire corals possess stinging cells (nematocysts), which would normally prevent close contact. Afforded some degree of protection by their living perches, hawkfishes seek the high ground of the reef, where they warily survey their surroundings like hawks. This is said to have inspired their common name.\nMost hawkfishes are solitary in nature, but some will form pairs and share a head of coral. Other species form harems of up to seven females dominated by a larger male. They are diurnal, and remain within the shallows of the reef, no deeper than 30 m. Typically motionless, hawkfishes will dart out to grab crustaceans and other small invertebrates which happen to pass by.\nSpawning occurs at night, at or near the water's surface. Hawkfishes are pelagic spawners; they release many tiny buoyant eggs which drift with the ocean currents until hatching. Hatching is thought to happen after about three weeks; the distance travelled in this time may explain their exceptionally wide distribution. They have not been successfully bred in the aquarium, with the exception of the longnose hawkfish.\nHawkfishes are noted for their protogynous hermaphrodism; functional females will change into males if the dominant supermale dies. Hawkfishes are generally not sexually dichromatic, meaning the sexes cannot be distinguished by coloration alone.", "Gobies": "Gobiidae is a family of bony fish in the order Gobiiformes, one of the largest fish families comprising more than 2,000 species in more than 200 genera, sometimes referred to as the \"true gobies\". Most of them are relatively small, typically less than 10 cm (3.9 in) in length. The Gobiidae includes some of the smallest vertebrates in the world, such as Trimmatom nanus and Pandaka pygmaea,Trimmatom nanus are under 1 cm (3⁄8 in) long when fully grown,then Pandaka pygmaea standard length are 9mm (0.35 in),maximum known standard length are 11 mm (0.43 in). Some large gobies can reach over 30 cm (0.98 ft) in length, but that is exceptional. Generally, they are benthic, or bottom-dwellers. Although few are important as food for humans, they are of great significance as prey species for commercially important fish such as cod, haddock, sea bass, and flatfish. Several gobiids are also of interest as aquarium fish, such as the dartfish of the genus Ptereleotris. Phylogenetic relationships of gobiids have been studied using molecular data.", "Narkidae- sleeper rays": "Members of the family Narkidae are commonly known as sleeper rays. They are restricted to the temperate and tropical Indo-West Pacific from South Africa to Japan to Indonesia, and are exclusively marine and are absent from freshwater habitats. They occur from the intertidal zone to the continental shelf and the upper continental slope to a depth of 350 meters, favoring soft-bottomed habitats.", "Jacks": "The Carangidae are a family of ray-finned fish which includes the jacks, pompanos, jack mackerels, runners, and scads. It is the largest of the six families included within the order Carangiformes. Some authorities classify it as the only family within that order but molecular and anatomical studies indicate that there is a close relationship between this family and the five former Perciform families which make up the Carangiformes.They are marine fishes found in the Atlantic, Indian and Pacific Oceans. Most species are fast-swimming predatory fishes that hunt in the waters above reefs and in the open sea; some dig in the sea floor for invertebrates.The largest fish in the family, the greater amberjack, Seriola dumerili, grows up to 2 m in length; most fish in the family reach a maximum length of 25–100 cm.\nThe family contains many important commercial and game fish, notably the Pacific jack mackerel, Trachurus symmetricus, and the other jack mackerels in the genus Trachurus.Many genera have fairly extensive fossil records, particularly Caranx and Seriola, which extend into the early Paleogene (late Thanetian), and are known from whole and incomplete specimens, skeletal fragments, and otoliths.  The several extinct genera include Archaeus, Pseudovomer, and Eastmanalepes.", "Scorpionfish": "The Scorpaenidae (also known as scorpionfish) are a family of mostly marine fish that includes many of the world's most venomous species. As their name suggests, scorpionfish have a type of \"sting\" in the form of sharp spines coated with venomous mucus. The family is a large one, with hundreds of members. They are widespread in tropical and temperate seas, but mostly found in the Indo-Pacific. They should not be confused with the cabezones, of the genus Scorpaenichthys, which belong to a separate, though related, family, Cottidae.", "Snappers": "Snappers are a family of perciform fish, Lutjanidae, mainly marine, but with some members inhabiting estuaries, feeding in fresh water. The family includes about 113 species. Some are important food fish. One of the best known is the red snapper.\nSnappers inhabit tropical and subtropical regions of all oceans. Some snappers grow up to about 1 m (3.3 ft) in length however one specific Snapper, the Cubera Snapper, grows up to 5 ft in length. Most are active carnivores, feeding on crustaceans or other fish, though a few are plankton-feeders. They can be kept in aquaria, but mostly grow too fast to be popular aquarium fish. Most species live at depths reaching 100 m (330 ft) near coral reefs, but some species are found up to 500 m (1,600 ft) deep.\n\nAs other fish, snappers harbour parasites. A detailed study conducted in New Caledonia has shown that coral reef-associated snappers harbour about 9 species of parasites per fish species.", "Glaucostegidae-giant guitarfishes": "Rhinopristiformes is an order of rays, cartilaginous fishes related to sharks, containing shovelnose rays and allied groups.", "Hexatrygonidae-sixgill-stingrays": "The sixgill stingray (Hexatrygon bickelli) is a species of stingray and the only extant member of the family Hexatrygonidae. Although several species of sixgill stingrays have been described historically, they may represent variations in a single, widespread species. This flabby, heavy-bodied fish, described only in 1980, is unique among rays in having six pairs of gill slits rather than five. Growing up to 1.7 m (5.6 ft) long, it has a rounded pectoral fin disc and a long, triangular, and flexible snout filled with a gelatinous substance. It is brownish above and white below, and lacks dermal denticles.\nBenthic in nature, the sixgill stingray is usually found over upper continental slopes and seamounts at depths of 500–1,120 m (1,640–3,670 ft). It has been recorded from scattered locations in the Indo-Pacific from South Africa to Hawaii. This species probably uses its snout to probe for food in the bottom sediment. Its jaws are greatly protrusible, allowing it to capture buried prey. The sixgill stingray gives live birth, with litters of two to five pups. The IUCN has assessed this ray as Least Concern, because it faces minimal fishing pressure across most of its range.", "Tilefish": "Tilefishes are mostly small perciform marine fish comprising the family Malacanthidae. They are usually found in sandy areas, especially near coral reefs.Commercial fisheries exist for the largest species, making them important food fish.  However, the US Food and Drug Administration warns pregnant or breastfeeding women against eating tilefish and some other fish due to mercury contamination.\n The smaller, exceptionally colorful species of tilefish are enjoyed in the aquarium.", "Myliobatis-common eagle ray": "The common eagle ray (Myliobatis aquila) is a species of fish in the family Myliobatidae. It inhabits the eastern Atlantic Ocean (North Sea to South Africa), the Mediterranean Sea and the south-western Indian Ocean.", "Trygonorrhinidae-banjo rays": "Batoidea is a superorder of cartilaginous fishes commonly known as rays. They and their close relatives, the sharks, comprise the subclass Elasmobranchii. Rays are the largest group of cartilaginous fishes, with well over 600 species in 26 families. Rays are distinguished by their flattened bodies, enlarged pectoral fins that are fused to the head, and gill slits that are placed on their ventral surfaces.\n\n", "Squirrelfish": "Holocentrinae is a subfamily of Holocentridae containing 40 recognized species and one proposed species. Its members are typically known as squirrelfish and all are nocturnal. All three genera in the subfamily are found in the Atlantic and Holocentrus is restricted to this ocean. Most species in genera Neoniphon and Sargocentron are from the Indo-Pacific region and several of these occur in the Indian Ocean west of the southern tip of India.", "Gymnuridae-butterfly-ray": "The butterfly rays are the rays forming the genus Gymnura and the family Gymnuridae. They are found in warm oceans worldwide, and occasionally in estuaries.\nThe body of butterfly rays is flattened and surrounded by an extremely broad disc formed by the pectoral fins, which merge in front of the head. They have a very short, thread-like, tail. They are up to 4 m (13 ft) in width.McEachran et al. place the butterfly rays in the subfamily Gymnurinae of the family Dasyatidae, but this article follows FishBase and ITIS in treating them as a family.", "Rhinobatidae-Guitarfish": "The guitarfish are a family, Rhinobatidae, of rays. The guitarfish are known for an elongated body with a flattened head and trunk and small, ray-like wings. The combined range of the various species is tropical, subtropical, and warm temperate waters worldwide.", "Wrasse": "The wrasses are a family, Labridae, of marine fish, many of which are brightly colored. The family is large and diverse, with over 600 species in 81 genera, which are divided into 9 subgroups or tribes.\nThey are typically small fish, most of them less than 20 cm (7.9 in) long, although the largest, the humphead wrasse, can measure up to 2.5 m (8.2 ft). They are efficient carnivores, feeding on a wide range of small invertebrates. Many smaller wrasses follow the feeding trails of larger fish, picking up invertebrates disturbed by their passing. Juveniles of some representatives of the genera Bodianus, Epibulus, Cirrhilabrus, Oxycheilinus, and Paracheilinus hide among the tentacles of the free-living mushroom coral Heliofungia actiniformis.The word \"wrasse\" comes from the Cornish word wragh, a lenited form of gwragh, meaning an old woman or hag, via Cornish dialect wrath. It is related to the Welsh gwrach and Breton gwrac'h.", "Pipefish": "Pipefishes or  pipe-fishes (Syngnathinae) are a subfamily of small fishes, which, together with the seahorses and seadragons (Phycodurus and Phyllopteryx), form the family Syngnathidae.", "mackerels": "Mackerel is a common name applied to a number of different species of pelagic fish, mostly from the family Scombridae. They are found in both temperate and tropical seas, mostly living along the coast or offshore in the oceanic environment.\nMackerel species typically have vertical stripes on their backs and deeply forked tails. Many are restricted in their distribution ranges and live in separate populations or fish stocks based on geography. Some stocks migrate in large schools along the coast to suitable spawning grounds, where they spawn in fairly shallow waters. After spawning they return the way they came in smaller schools to suitable feeding grounds, often near an area of upwelling. From there they may move offshore into deeper waters and spend the winter in relative inactivity. Other stocks migrate across oceans.\nSmaller mackerel are forage fish for larger predators, including larger mackerel and Atlantic cod.  Flocks of seabirds, whales, dolphins, sharks, and schools of larger fish such as tuna and marlin follow mackerel schools and attack them in sophisticated and cooperative ways. Mackerel flesh is high in omega-3 oils and is intensively harvested by humans. In 2009, over 5 million tons were landed by commercial fishermen.  Sport fishermen value the fighting abilities of the king mackerel.", "Eels": "An eel is any ray-finned fish belonging to the order Anguilliformes (), which consists of eight suborders, 19 families, 111 genera, and about 800 species. Eels undergo considerable development from the early larval stage to the eventual adult stage, and most are predators.\nThe term \"eel\" is also used for some other eel-shaped fish, such as electric eels (genus Electrophorus), spiny eels (family Mastacembelidae), and deep-sea spiny eels (family Notacanthidae). These other clades, however, evolved their eel-like shapes independently from the true eels.", "Urotrygonidae-American -round-stingrays": "\"Round stingray\" may also refer to Taeniura grabata.\n\nThe round stingray (Urobatis halleri) or Haller's round ray and Little round stingray is a species of round ray, family Urotrygonidae, found in the coastal waters of the eastern Pacific Ocean. It is a small, common ray that feeds mostly on benthic invertebrates. On the beaches of southern California, it is responsible for numerous injuries to bathers, who are stung when they accidentally step on the fish. The wound caused by its venomous spine can be painful, but is non-fatal.", "Dragonets": "Dragonets are small, percomorph, marine fish of the diverse family Callionymidae (from the Greek kallis, \"beautiful\" and onyma, \"name\") found mainly in the tropical waters of the western Indo-Pacific. They are benthic organisms, spending most of their time near the sandy bottoms, at a depth of roughly two hundred meters. There exist 139 species of the fish, in nineteen genera.\nDue to similarities in morphology and behavior, dragonets are sometimes confused with members of the goby family. However, male dragonets can be differentiated from the goby by their very long dorsal fins, and females by their protruding lower jaws. The Draconettidae may be considered a sister family, whose members are very much alike, though rarely seen.", "Tangs": "Acanthuridae are the family of surgeonfishes, tangs, and unicornfishes. The family includes about 86 extant species of marine fish living in tropical seas, usually around coral reefs. Many of the species are brightly colored and popular in aquaria.\nThe distinctive characteristic of the family is that they have scalpel-like modified scales, one or more on either side of the peduncle of the tail. The spines are dangerously sharp and may seriously injure anyone who carelessly handles such a fish. The dorsal, anal, and caudal fins are large, extending for most of the length of the body. The mouths are small and have a single row of teeth adapted to grazing on algae.Surgeonfishes sometimes feed as solitary individuals, but they often travel and feed in schools. Feeding in schools may be a mechanism for overwhelming the highly aggressive defense responses of small territorial damselfishes that vigorously guard small patches of algae on coral reefs.Most species are fairly small, with a maximum length of 15–40 cm (6–15.5 in), but some in the genus Acanthurus, some in the genus Prionurus, and most species in the genus Naso may grow larger; the whitemargin unicornfish (Naso annulatus) is the largest species in the family, reaching a length of up to 1 m (3 ft 3 in). These fishes may grow quickly in aquaria, so average growth size and suitability should be checked before adding them to any marine aquarium.", "Zanobatidae-Panray": "The panrays are a genus, Zanobatus, of rays found in coastal parts of the warm East Atlantic Ocean, ranging from Morocco to Angola. It is the only genus in the family Zanobatidae, which traditionally has been included in the Myliobatiformes order, but based on genetic evidence it is now in Rhinopristiformes or a sister taxon to Rhinopristiformes.The two species of panrays are generally poorly known and one of the species was only scientifically described in 2016. They are up to about 60 cm (2 ft) long, and brownish above with a heavily mottled, blotched or barred dark pattern. They are ovoviviparous and feed on benthic invertebrates.", "Spinetail mobula-devilray": "The spinetail devil ray (Mobula japonica), also known as the spinetail mobula ray or japanese mobula ray, is a species of pelagic marine fish which belongs to the family Mobulidae. It is found throughout the tropical and sub-tropical waters of the Indo-Pacific and eastern Atlantic Ocean.", "Arhynchobatidae-softnose-skates": "Skates are cartilaginous fish belonging to the family Rajidae in the superorder Batoidea of rays. More than 150 species have been described, in 17 genera. Softnose skates and pygmy skates were previously treated as subfamilies of Rajidae (Arhynchobatinae and Gurgesiellinae), but are now considered as distinct families. Alternatively, the name \"skate\" is used to refer to the entire order of Rajiformes (families Anacanthobatidae, Arhynchobatidae, Gurgesiellidae and Rajidae).Members of Rajidae are distinguished by their stiff snout and a rostrum that is not reduced.", "Rhinidae-Wedgefishes": "Wedgefishes are rays of the family Rhinidae, comprising ten species in three genera. Classified in the order Rhinopristiformes along with guitarfishes and sawfishes, they have also been known as giant guitarfishes or sharkfin guitarfishes.", "Rabbitfish": "Rabbitfishes or spinefoots are perciform fishes in the family Siganidae. The 29 species are in a single genus, Siganus. In some now obsolete classifications, the species having prominent face stripes—colloquially called foxfaces–are in the genus Lo. Other species, such as the masked spinefoot (S. puellus), show a reduced form of the stripe pattern. Rabbitfishes are native to shallow waters in the Indo-Pacific, but S. luridus and S. rivulatus have become established in the eastern Mediterranean via Lessepsian migration. They are commercially important food fish, and can be used in the preparation of dishes such as bagoong.", "Bass_and_groupers": "Groupers are fish of any of a number of genera in the subfamily Epinephelinae of the family Serranidae, in the order Perciformes. Not all serranids are called 'groupers'; the family also includes the sea basses. The common name 'grouper' is usually given to fish in one of two large genera: Epinephelus and Mycteroperca. In addition, the species classified in the small genera Anyperidon, Cromileptes, Dermatolepis, Gracila, Saloptia, and Triso are also called 'groupers'. Fish in the genus Plectropomus are referred to as 'coralgroupers'. These genera are all classified in the subfamily Epiphelinae. However, some of the hamlets (genus Alphestes), the hinds (genus Cephalopholis), the lyretails (genus Variola) and some other small genera (Gonioplectrus, Niphon, Paranthias) are also in this subfamily, and occasional species in other serranid genera have common names involving the word 'grouper'. Nonetheless, the word 'grouper' on its own is usually taken as meaning the subfamily Epinephelinae. ", "Pristidae-Sawfish": "Sawfishes,  also known as carpenter sharks, are a family of rays characterized by a long, narrow, flattened rostrum, or nose extension, lined with sharp transverse teeth, arranged in a way that resembles a saw. They are among the largest fish with some species reaching lengths of about 7–7.6 m (23–25 ft). They are found worldwide in tropical and subtropical regions in coastal marine and brackish estuarine waters, as well as freshwater rivers and lakes.They should not be confused with sawsharks (order Pristiophoriformes) or the extinct sclerorhynchids (order Sclerorhynchiformes) which have a similar appearance, or swordfish (family Xiphiidae) which have a similar name but a very different appearance.Sawfishes are relatively slow breeders and the females give birth to live young. They feed on fish and invertebrates that are detected and captured with the use of their saw. They are generally harmless to humans, but can inflict serious injuries with the saw when captured and defending themselves.Sawfish have been known and hunted for thousands of years, and play an important mythological and spiritual role in many societies around the world.Once common, sawfish have experienced a drastic decline in recent decades, and the only remaining strongholds are in Northern Australia and Florida, United States. The five species are rated as Endangered or Critically Endangered by the IUCN. They are hunted for their fins (shark fin soup), use of parts as traditional medicine, their teeth and saw. They also face habitat loss. Sawfish have been listed by CITES since 2007, restricting international trade in them and their parts. They are protected in Australia, the United States and several other countries, meaning that sawfish caught by accident have to be released and violations can be punished with hefty fines.", "Lionfish": "Pterois is a genus of venomous marine fish, commonly known as lionfish, native to the Indo-Pacific. Also called zebrafish, firefish, turkeyfish, tastyfish or butterfly-cod, it is characterized by conspicuous warning coloration with red, white, creamy, or black bands, showy pectoral fins, and venomous spiky fin rays. Pterois radiata, Pterois volitans, and Pterois miles are the most commonly studied species in the genus. Pterois species are popular aquarium fish. P. volitans and P. miles are recent and significant invasive species in the west Atlantic, Caribbean Sea and Mediterranean Sea.", "Clownfish": "Clownfish or anemonefish are fishes from the subfamily Amphiprioninae in the family Pomacentridae. Thirty species are recognized: one in the genus Premnas, while the remaining are in the genus Amphiprion. In the wild, they all form symbiotic mutualisms with sea anemones.  Depending on species, anemonefish are overall yellow, orange, or a reddish or blackish color, and many show white bars or patches. The largest can reach a length of 17 cm (6.7 in), while the smallest barely achieve 7–8 cm (2.8–3.1 in).", "Hogfish": "The hogfish (Lachnolaimus maximus) is a species of wrasse native to the Western Atlantic Ocean, living in a range from Nova Scotia, Canada, to northern South America, including the Gulf of Mexico.  This species occurs around reefs, especially preferring areas with plentiful gorgonians.  This species is currently the only known member of its genus.", "Grunts": "Haemulidae is a family of fishes in the order Perciformes known commonly as grunts. It is made up of the two subfamilies Haemulinae (grunters) and Plectorhynchinae (sweetlips), which in turn contain about 133 species in 19 genera. These fish are found in tropical fresh, brackish, and salt waters around the world. They are bottom-feeding predators, and named for the ability of Haemulinae to produce sound by grinding their teeth. They also engage in mutualistic relationship with cleaner gobies of genus Elacatinus, allowing them to feed on ectoparasites on their bodies.", "Damselfish": "Damselfishes comprise the family Pomacentridae except those of the genera Amphiprion and Premnas, which are the anemonefishes. The largest can grow up to 36 cm (14 in) long, but most species are much smaller. While most are marine, a few species inhabit the lower stretches of rivers in fresh water. Most damselfish species have bright colors or strongly contrasting patterns.", "Urolophidae-stingarees or round stingray": "The Urolophidae are a family of rays in the order Myliobatiformes, commonly known as stingarees or round stingrays. This family formerly included the genera Urobatis and Urotrygon of the Americas, which are presently recognized as forming their own family Urotrygonidae. Stingarees are found in the Indo-Pacific region, with the greatest diversity off Australia. They are sluggish, bottom-dwelling fish that have been recorded from shallow waters close to shore to deep waters over the upper continental slope. Measuring between 15 and 80 cm (5.9 and 31.5 in) long, these rays have oval to diamond-shaped pectoral fin discs and relatively short tails that terminate in leaf-shaped caudal fins, and may also have small dorsal fins and lateral skin folds. Most are smooth-skinned, and some have ornate dorsal color patterns.\nStingarees feed on or near the sea floor, consuming small invertebrates and occasionally bony fishes. They are aplacental viviparous, meaning their embryos emerge from eggs inside the uterus, and are sustained to term first by yolk and later by maternally produced histotroph (\"uterine milk\"). As far is known, the gestation period lasts around a year and litter sizes tend to be small. Stingarees have one or two relatively large, venomous stinging spines on their tail for defense, with which they can inflict a painful wound on humans. Generally, stingarees have no economic value. Some species form a substantial component of the bycatch of commercial trawl fisheries.", "Platyrhinidae-thornbacks": "The Platyrhinidae are a family of rays, commonly known as thornbacks due to their dorsal rows of large thorns. They resemble guitarfishes in shape. Though traditionally classified with stingrays, molecular evidence suggests they are more closely related to electric rays in the order Torpediniformes.", "Cardinalfish": "Cardinalfishes are a family, Apogonidae, of ray-finned fishes found in the Atlantic, Indian, and Pacific Oceans; they are chiefly marine, but some species are found in brackish water and a few (notably Glossamia) are found in fresh water. A handful of species are kept in the aquarium and are popular as small, peaceful, and colourful fish. The family includes about 370 species.\nThey are generally small fish, with most species being less than 10 cm (4 in), and are often brightly coloured. They are distinguished by their large mouths, and the division of the dorsal fin into two separate fins. Most species live in tropical or subtropical waters, where they inhabit coral reefs and lagoons.They are nocturnal, spending the day in dark crevices within the reef. At least some species brood their eggs inside the mouths of the males.", "Angelfish_(dwarf)": "The flame angelfish (Centropyge loriculus) is a marine angelfish of the family Pomacanthidae found in tropical waters of the Pacific Ocean. Other common names include flame angel, flaming angelfish and Japanese pygmy angelfish.", "Torpedinidae-torpedoes": "Tetronarce is a genus of rays, commonly known as electric rays. They are slow-moving bottom-dwellers capable of generating electricity as a defense and feeding mechanism. Tetronarce species tend to attain a much larger size (up to 180 cm TL) than Torpedo species, which are usually small to moderate sized (range from 25 to 80 cm TL) electric rays.", "Rhinoptera-cownose ray": "For other species of cownose rays, see Rhinoptera.\n\nThe cownose ray (Rhinoptera bonasus) is a species of eagle ray found throughout a large part of the western Atlantic and Caribbean, from New England, United States to southern Brazil (East Atlantic populations are now generally considered a separate species, R. marginata). Cownose rays grow rapidly, and male rays often reach about 35 inches (89 cm) in width and weigh 26 pounds (12 kg). Females typically reach 28 inches (71 cm) in width and weigh 36 pounds (16 kg). These rays also belong to the order Myliobatiformes, a group that is shared by bat rays, manta rays, and eagle rays.\n\n", "Idols": "The Moorish idol (Zanclus cornutus) is a marine fish species, the sole extant representative of the family Zanclidae (from the Greek ζαγκίος, zagkios, \"oblique\") in  order  Perciformes.  A common inhabitant of tropical to subtropical reefs and lagoons, the Moorish idol is notable for its wide distribution throughout the Indo-Pacific.  A number of butterflyfishes (genus Heniochus) closely resemble the Moorish idol. It is closely related to, if not a direct descendant of, the extinct Eozanclus brevirostris, from the Middle Eocene of Monte Bolca.\nThe Moorish idol got its name from the Moors of Africa, who purportedly believed the fish to be a bringer of happiness.  Moorish idols are also a coveted aquarium fish but, despite their abundance and wide array of habitats, they are notoriously finicky and hard to adjust to captivity. Their omnivorous diet can be extremely difficult to replicate in aquaria, as the vegetation which they live on is normally exterminated and they have a habit of eating corals and sponges.", "Anthias": "The following list of marine aquarium fish species commonly available in the aquarium trade is not a completely comprehensive list; certain rare specimens may available commercially yet not be listed here. A brief section on each, with a link to the page about the particular species is provided along with references for further information.", "Potamotrygonidae-River stingrays or freshwater stingrays": "Stingrays are a group of sea rays, which are cartilaginous fish related to sharks. They are classified in the suborder Myliobatoidei of the order Myliobatiformes and consist of eight families: Hexatrygonidae (sixgill stingray), Plesiobatidae (deepwater stingray), Urolophidae (stingarees), Urotrygonidae (round rays), Dasyatidae (whiptail stingrays), Potamotrygonidae (river stingrays), Gymnuridae (butterfly rays), and Myliobatidae (eagle rays).Stingrays are common in coastal tropical and subtropical marine waters throughout the world. Some species, such as Dasyatis thetidis, are found in warmer temperate oceans, and others, such as Plesiobatis daviesi, are found in the deep ocean. The river stingrays, and a number of whiptail stingrays (such as the Niger stingray), are restricted to fresh water. Most myliobatoids are demersal (inhabiting the next-to-lowest zone in the water column), but some, such as the pelagic stingray and the eagle rays, are pelagic.There are about 220 known stingray species organized into ten families and 29 genera. Stingray species are progressively becoming threatened or vulnerable to extinction, particularly as the consequence of unregulated fishing. As of 2013, 45 species have been listed as vulnerable or endangered by the IUCN. The status of some other species is poorly known, leading to their being listed as data deficient.\n\n", "Hamlet": "Hypoplectrus is a genus of fishes commonly known as hamlets, found mainly in coral reefs in the Caribbean Sea and the Gulf of Mexico, particularly around Florida and the Bahamas. They are a popular choice for hobbyist saltwater aquariums, and come in a variety of colors.", "Aetomylaeus-Eagle-ray": "The eagle rays are a group of cartilaginous fishes in the family Myliobatidae, consisting mostly of large species living in the open ocean rather than on the sea bottom.\nEagle rays feed on mollusks and crustaceans, crushing their shells with their flattened teeth.They are excellent swimmers and are able to breach the water up to several metres above the surface. Compared with other rays, they have long tails, and well-defined, rhomboidal bodies. They are ovoviviparous, giving birth to up to six young at a time. They range from 0.48 to 5.1 m (1.6 to 16.7 ft) in length and 7 m in wingspan (Mobula birostris).", "Triggerfish": "Triggerfish are about 40 species of often brightly colored fish of the family Balistidae. Often marked by lines and spots, they inhabit tropical and subtropical oceans throughout the world, with the greatest species richness in the Indo-Pacific. Most are found in relatively shallow, coastal habitats, especially at coral reefs, but a few, such as the oceanic triggerfish (Canthidermis maculata), are pelagic. While several species from this family are popular in the marine aquarium trade, they are often notoriously ill-tempered.", "Narcinidae-Electric ray": "The electric rays are a group of rays, flattened cartilaginous fish with enlarged pectoral fins, composing the order Torpediniformes. They are known for being capable of producing an electric discharge, ranging from 8 to 220 volts, depending on species, used to stun prey and for defense. There are 69 species in four families.\nPerhaps the best known members are those of the genus Torpedo, also called crampfish and numbfish. The torpedo is named after it. The name comes from the Latin torpere, to be stiffened or paralyzed, referring to the effect on someone who handles or steps on a living electric ray.", "Angelfish_(large)": "The following list of marine aquarium fish species commonly available in the aquarium trade is not a completely comprehensive list; certain rare specimens may available commercially yet not be listed here. A brief section on each, with a link to the page about the particular species is provided along with references for further information.", "Gurgesiellidae-pygmy-skates": "Skates are cartilaginous fish belonging to the family Rajidae in the superorder Batoidea of rays. More than 150 species have been described, in 17 genera. Softnose skates and pygmy skates were previously treated as subfamilies of Rajidae (Arhynchobatinae and Gurgesiellinae), but are now considered as distinct families. Alternatively, the name \"skate\" is used to refer to the entire order of Rajiformes (families Anacanthobatidae, Arhynchobatidae, Gurgesiellidae and Rajidae).Members of Rajidae are distinguished by their stiff snout and a rostrum that is not reduced.", "Batfish": "USS Batfish (SS/AGSS-310), is a Balao-class submarine, known primarily for the remarkable feat of sinking three Imperial Japanese Navy submarines in a 76-hour period, in February 1945.  USS Batfish is the first vessel of the United States Navy to be named for the batfish, a fish found off the coast of Peru, at depths ranging from 3 to 76 metres.", "Foxface": "Rabbitfishes or spinefoots are perciform fishes in the family Siganidae. The 29 species are in a single genus, Siganus. In some now obsolete classifications, the species having prominent face stripes—colloquially called foxfaces–are in the genus Lo. Other species, such as the masked spinefoot (S. puellus), show a reduced form of the stripe pattern. Rabbitfishes are native to shallow waters in the Indo-Pacific, but S. luridus and S. rivulatus have become established in the eastern Mediterranean via Lessepsian migration. They are commercially important food fish, and can be used in the preparation of dishes such as bagoong.", "Basslets_and_assessors": "Gramma is a genus of fishes native to tropical waters of the western Atlantic Ocean and the Caribbean Sea.", "Anacanthobatidae-leg-skates": "The Anacanthobatidae, the smooth skates or leg skates, are a family of skates found at depths below 200 m (660 ft) in the Indian, Pacific and Atlantic Oceans.They lack the dorsal denticles (sharp, tooth-like scales) of other rays, hence their name, from Greek an- meaning \"without\", acantha meaning \"thorn\", and bathys meaning \"deep\".\nThey are bottom-dwelling fishes found on the continental slopes of tropical and subtropical waters.", "Chromis": "Chromis viridis (green chromis) is a species of damselfish. Individuals tend to be iridescent apple-green and light blue, and reach a maximal length of 10 cm.It is sometimes called the \"blue-green chromis\", but that may also refer to Chromis caerulea, the blue puller, a close relative that is sometimes considered conspecific.", "Boxfish_and_blowfish": "Ostraciidae is a family of squared, bony fish belonging to the order Tetraodontiformes, closely related to the pufferfishes and filefishes. Fish in the family are known variously as boxfishes, cofferfishes, cowfishes and trunkfishes. It contains about 23 extant species in 6 extant genera.", "Seahorses": "Seahorse (also written sea-horse and sea horse) is the name given to 46 species of small marine fish in the genus Hippocampus. \"Hippocampus\" comes from the Ancient Greek hippokampos (ἱππόκαμπος hippókampos), itself from  hippos (ἵππος híppos) meaning \"horse\" and kampos (κάμπος kámpos) meaning \"sea monster\". Having a head and neck suggestive of a horse, seahorses also feature segmented bony armour, an upright posture and a curled prehensile tail.", "Hypnidae-Coffin ray": "Hypnos monopterygius, also known as the coffin ray or Australian numbfish, is a species of electric ray endemic to Australia, where it is common in inshore waters shallower than 80 m (260 ft). It is the sole member of its family  Hypnidae. This small species typically reaches 40 cm (16 in) in length. Greatly enlarged pectoral fins and an extremely short tail, coupled with diminutive dorsal and caudal fins all concentrated towards the rear, give the coffin ray a distinctive pear-like shape. It is a varying shade of brown in color above, and has tiny eyes and a large, highly distensible mouth.\nThe sluggish and nocturnal coffin ray frequents sandy or muddy habitats, where it can bury itself during daytime. It can produce a powerful electric shock reaching 200 volts for attack and defense. This species is a voracious predator that feeds mainly on benthic bony fishes, often tackling fish approaching or exceeding itself in size. On occasion, it may also consume invertebrates and even small penguins and rats. Reproduction is aplacental viviparous, in which the developing embryos are nourished by yolk and maternally produced histotroph (\"uterine milk\"). The female gives birth to 4–8 pups during summer. The coffin ray can deliver a severe, albeit non-fatal, shock to a human. Not valued commercially, it is very hardy and can usually survive being captured and discarded. The International Union for Conservation of Nature (IUCN) has listed this species under Least Concern, as its population does not seem threatened by human activity.", "Plesiobatidae-deepwater stingray or giant stingaree": "The deepwater stingray or giant stingaree (Plesiobatis daviesi) is a species of stingray and the sole member of the family Plesiobatidae. It is widely distributed in the Indo-Pacific, typically over fine sediments on the upper continental slope at depths of 275–680 m (900–2,230 ft). This species reaches 2.7 m (8.9 ft) in length and 1.5 m (4.9 ft) in width. It has an oval pectoral fin disc with a long, flexible, broad-angled snout. Most of the entire latter half of its tail supports a distinctively long, slender, leaf-shaped caudal fin. Its coloration is dark above and white below, and its skin is almost completely covered by tiny dermal denticles.\nPreying on crustaceans, cephalopods, and bony fishes, the deepwater stingray may hunt both on the sea floor and well above it in open water. It is probably aplacental viviparous, with the mother supplying her gestating young with histotroph (\"uterine milk\"). Captured rays merit caution due to their long, venomous stingers. This species is taken by deepwater commercial fisheries, but in numbers too small to significantly threaten its population. Therefore, the International Union for Conservation of Nature  has assessed it as Least Concern.", "Dartfish": "Dartfishes are a group of fish, formerly considered to be a subfamily, Ptereleotrinae, of goby-like fishes in the family Microdesmidae of the order Gobiiformes, Authorities now consider the species in the family Microdesmidae are within the Gobiidae, although the researchers do not define the taxonomic status of this grouping within that family. They are saltwater fish.", "Parrotfish": "Parrotfishes are a group of about 95 fish species  regarded as a family (Scaridae), or a subfamily (Scarinae) of the wrasses. With about 95 species, this group's largest species richness is in the Indo-Pacific. They are found in coral reefs, rocky coasts, and seagrass beds, and can play a significant role in bioerosion.\n\n", "Mobula birostris-manta ray": "The giant oceanic manta ray (Mobula birostris) is a species of ray in the family Mobulidae, and the largest type of ray in the world. They are circumglobal and are typically found in tropical and subtropical waters, but can also be found in temperate waters.  Until 2017, giant mantas were classified in the genus Manta, along with the smaller reef manta (Mobula alfredi).  DNA testing revealed that both species are more closely related to  rays of the genus Mobula than previously thought.  As a result, giant mantas were renamed Mobula birostris to reflect the new classification.", "Butterflyfish": "The butterflyfish are a group of conspicuous tropical marine fish of the family Chaetodontidae; the bannerfish and coralfish are also included in this group. The approximately 129 species in 12 genera are found mostly on the reefs of the Atlantic, Indian, and Pacific Oceans.  A number of species pairs occur in the Indian and Pacific Oceans, members of the huge genus Chaetodon.\nButterflyfish look like smaller versions of angelfish (Pomacanthidae), but unlike these, lack preopercle spines at the gill covers. Some members of the genus Heniochus resemble the Moorish idol (Zanclus cornutus) of the monotypic Zanclidae. Among the paraphyletic Perciformes, the former are probably not too distantly related to butterflyfish, whereas the Zanclidae seem far less close."}
